ducklove/esp32-epaper-fm-radio/src/boards/p4/main.cpp
// Waveshare ESP32-P4-WIFI6-Touch-LCD-3.5 인터넷 스트리밍 FM 라디오
//
// 세 번째 보드. 앞의 둘(ESP32-S3)과 코덱(ES8311)은 같아서 오디오 경로는 핀
// 번호만 다르고, 근본적으로 다른 것은 둘이다.
//
// 1) 무선이 P4 안에 없다. 옆의 ESP32-C6 가 SDIO 로 Wi-Fi 를 대신한다
//    (ESP-Hosted). Arduino 3.3 이 감춰 주어 WiFi.begin() 은 그대로지만,
//    부팅에 C6 리셋 1.5초가 더 들고, 호스트와 C6 펌웨어의 버전이 맞아야 한다.
//    부팅 로그에 두 버전이 찍힌다.
//
// 2) 화면이 크고 터치가 된다. 버튼 대신 화면을 눌러 조작한다. 조작 방법은
//    ui.h 에. 전원은 AXP2101 이 진짜로 끊고, PWR 버튼으로 다시 켠다.
#include <Arduino.h>
#include <ArduinoOTA.h>
#include <Audio.h>
#include <Preferences.h>
#include <WiFi.h>
#include <Wire.h>
#include <esp_system.h>

#include "c6update.h"
#include "config.h"
#include "es8311.h"
#include "hw.h"
#include "log.h"
#include "secrets.h"
#include "stations.h"
#include "touch.h"
#include "ui.h"
#include "wifisetup.h"

#if CONFIG_ESP_HOSTED_ENABLED
#include "esp32-hal-hosted.h"
#endif

// ── 상수 ──────────────────────────────────────────────────────────
constexpr uint8_t  kVolumeSteps     = 20;
constexpr uint8_t  kDefaultVolume   = 12;
constexpr uint8_t  kDefaultIndex    = 2;      // KBS Classic FM 93.1
constexpr uint32_t kWifiFirstTryMs  = 25000;
constexpr uint32_t kWifiRetryMs     = 15000;
constexpr uint8_t  kWifiAttempts    = 3;
constexpr uint32_t kWifiRecoveryMs  = 30000;
constexpr uint32_t kWifiLostRestartMs = 45000;  // 끊긴 채 이만큼 지나면 재시작
constexpr uint32_t kStatusPeriodMs  = 60000;
constexpr uint32_t kUiPeriodMs      = 1000;
constexpr uint32_t kTouchPeriodMs   = 20;     // 50Hz 폴링
constexpr uint32_t kDragFrameMs     = 50;     // 끄는 동안 다시 그리는 간격 (20fps)
constexpr uint32_t kRetryDelayMs    = 8000;
constexpr uint32_t kWifiPortalMs    = 5UL * 60 * 1000;

// ── 전역 ──────────────────────────────────────────────────────────
static Audio  audio;
static ES8311 codec;
static TaskHandle_t audioTaskHandle = nullptr;

struct Shared {
    uint8_t   index = kDefaultIndex;
    uint8_t   volume = kDefaultVolume;
    bool      paused = false;
    PlayState state = ST_BOOT;
    String    detail;
    uint32_t  bitrate = 0;
    HwPower   power;
    int16_t   wifiRssi = 0;
    uint8_t   wifiBars = 0;
};
static Shared            shared;
static SemaphoreHandle_t sharedLock;

static QueueHandle_t cmdQueue;
static QueueHandle_t uiEventQueue;   // 터치 태스크 -> loop
struct Cmd {
    enum Kind : uint8_t { TUNE, PAUSE, RESUME } kind;
    uint8_t index;
};

static inline void lockShared()   { xSemaphoreTake(sharedLock, portMAX_DELAY); }
static inline void unlockShared() { xSemaphoreGive(sharedLock); }

static void setState(PlayState st, const String& detail = String()) {
    lockShared();
    shared.state = st;
    shared.detail = detail;
    unlockShared();
}

// ── 설정 저장 ─────────────────────────────────────────────────────
// PMIC 가 전원을 진짜로 끊으면 RTC 메모리도 같이 날아간다. NVS 에 둔다.
static void loadPrefs() {
    Preferences p;
    if (p.begin("radio", true)) {
        const uint8_t idx = p.getUChar("station", kDefaultIndex);
        const uint8_t vol = p.getUChar("volume", kDefaultVolume);
        p.end();
        lockShared();
        shared.index = (idx < kStationCount) ? idx : kDefaultIndex;
        shared.volume = (vol <= kVolumeSteps) ? vol : kDefaultVolume;
        unlockShared();
    }
}

static void savePrefs() {
    lockShared();
    const uint8_t idx = shared.index, vol = shared.volume;
    unlockShared();
    Preferences p;
    if (p.begin("radio", false)) {
        p.putUChar("station", idx);
        p.putUChar("volume", vol);
        p.end();
    }
}

// ── 시각 ──────────────────────────────────────────────────────────
static bool haveTime = false;

static void syncNtp() {
    if (WiFi.status() != WL_CONNECTED) return;
    RLOGI("NTP 동기화 시도...");
    configTzTime(NTP_TZ, NTP_SERVER1, NTP_SERVER2);
    struct tm t = {};
    if (getLocalTime(&t, NTP_TIMEOUT_MS)) {
        haveTime = true;
        RLOGI("NTP 완료: %04d-%02d-%02d %02d:%02d", t.tm_year + 1900, t.tm_mon + 1,
              t.tm_mday, t.tm_hour, t.tm_min);
    } else {
        RLOGE("NTP 응답 없음");
    }
}

// ── Wi-Fi ─────────────────────────────────────────────────────────
static void applyWifiPowerSave(bool playing) {
    const bool sleepOn = playing ? WIFI_SLEEP_WHILE_PLAYING : WIFI_SLEEP_WHILE_IDLE;
    WiFi.setSleep(sleepOn ? WIFI_PS_MIN_MODEM : WIFI_PS_NONE);
    RLOGI("Wi-Fi 모뎀 슬립: %s (%s)", sleepOn ? "on" : "off", playing ? "재생" : "유휴");
}

// ── 볼륨 ──────────────────────────────────────────────────────────
static float volumeToDb(uint8_t vol) { return -40.0f + 2.0f * (float)vol; }

static void applyVolume() {
    lockShared();
    const uint8_t vol = shared.volume;
    const bool    paused = shared.paused;
    unlockShared();
    if (paused) return;

    if (vol == 0) {
        codec.setMute(true);
    } else {
        codec.setMute(false);
        codec.setVolumeDb(volumeToDb(vol));
    }
}

// ── 오디오 태스크 ─────────────────────────────────────────────────
static void tune(uint8_t index) {
    if (index >= kStationCount) return;
    const Station& st = kStations[index];

    audio.stopSong();
    setState(ST_TUNING);
    RLOGI("선국: %s (%.1f MHz)", st.name, st.freq);

    const String url = resolveStreamUrl(st);
    if (url.isEmpty()) {
        setState(ST_ERROR, "NO STREAM");
        return;
    }
    if (!audio.connecttohost(url.c_str())) {
        setState(ST_ERROR, "CONNECT FAIL");
        return;
    }
    applyVolume();
    setState(ST_BUFFERING);
}

static void pauseAudio() {
    RLOGI("일시정지 — 스트림 종료");
    audio.stopSong();
    codec.setMute(true);
    hwSpeakerAmp(false);
    applyWifiPowerSave(false);

    lockShared();
    shared.paused = true;
    shared.state = ST_PAUSED;
    shared.bitrate = 0;
    unlockShared();
}

static void resumeAudio() {
    RLOGI("재개");
    applyWifiPowerSave(true);
    hwSpeakerAmp(true);

    lockShared();
    shared.paused = false;
    const uint8_t idx = shared.index;
    unlockShared();

    applyVolume();
    tune(idx);
}

static void audioTask(void*) {
    uint32_t codecRate = AUDIO_SAMPLE_RATE;
    uint32_t lastRetryMs = millis();

    for (;;) {
        Cmd cmd;
        if (xQueueReceive(cmdQueue, &cmd, 0) == pdTRUE) {
            switch (cmd.kind) {
                case Cmd::TUNE:   tune(cmd.index); break;
                case Cmd::PAUSE:  pauseAudio();    break;
                case Cmd::RESUME: resumeAudio();   break;
            }
        }

        {
            lockShared();
            const bool paused = shared.paused;
            unlockShared();
            if (paused) {
                vTaskDelay(pdMS_TO_TICKS(100));
                continue;
            }
        }

        audio.loop();

        const uint32_t rate = audio.getSampleRate();
        if (rate != 0 && rate != codecRate) {
            if (codec.setSampleRate(rate, AUDIO_MCLK_DIV)) {
                RLOGI("샘플레이트 변경: %u -> %u Hz", codecRate, rate);
                codecRate = rate;
            }
        }

        // 라이브러리 4.0 은 connecttohost() 가 바로 true 를 돌려주고 실제 접속은
        // loop() 안에서 한다. 거기서 실패하면(DNS, TLS, 소켓) 로그만 남기고 멈춘다
        // — 상태는 BUFFERING 인 채로. ERROR 에서만 재시도하던 상태 머신은 그
        // 자리에서 영원히 기다렸다(P4 에서 국악FM DNS 실패로 6분간 무반응).
        // 버퍼링이 이만큼 지나도 재생이 시작되지 않으면 오류로 쳐서 다시 붙는다.
        // 재생 중 끊겨 BUFFERING 으로 돌아간 경우도 같은 길을 탄다.
        constexpr uint32_t kStallMs = 45000;
        static uint32_t bufferingSince = 0;
        bool stalled = false;

