ducklove/esp32-epaper-fm-radio/src/boards/p4/main.cpp
        lockShared();
        if (shared.state == ST_BUFFERING && audio.isRunning()) shared.state = ST_PLAYING;
        else if (shared.state == ST_PLAYING && !audio.isRunning()) shared.state = ST_BUFFERING;
        if (shared.state == ST_BUFFERING) {
            if (!bufferingSince) bufferingSince = millis();
            else if (millis() - bufferingSince > kStallMs) {
                shared.state = ST_ERROR;
                shared.detail = "STREAM STALL";
                bufferingSince = 0;
                stalled = true;
            }
        } else {
            bufferingSince = 0;
        }
        const PlayState st = shared.state;
        const uint8_t   idx = shared.index;
        unlockShared();
        if (stalled) {
            RLOGE("스트림이 %lu초 넘게 시작되지 않음 — 다시 붙는다",
                  (unsigned long)(kStallMs / 1000));
        }

        if (st == ST_ERROR && WiFi.status() == WL_CONNECTED) {
            if (millis() - lastRetryMs > kRetryDelayMs) {
                lastRetryMs = millis();
                tune(idx);
            }
        } else if (st != ST_ERROR) {
            lastRetryMs = millis();
        }

        vTaskDelay(1);
    }
}

// ── 화면 상태 ─────────────────────────────────────────────────────
static UiState snapshotUi() {
    UiState u;
    lockShared();
    u.index = shared.index;
    u.state = shared.state;
    u.detail = shared.detail;
    u.paused = shared.paused;
    u.volume = shared.volume;
    u.bitrate = shared.bitrate;
    u.battery = shared.power.battery;
    u.vbus = shared.power.vbus;
    u.charging = shared.power.charging;
    u.battPercent = shared.power.percent;
    u.battVolts = shared.power.battMv / 1000.0f;
    u.wifiRssi = shared.wifiRssi;
    u.wifiBars = shared.wifiBars;
    unlockShared();

    u.freq = kStations[u.index].freq;
    u.name = kStations[u.index].name;
    u.volumeMax = kVolumeSteps;
    u.wifi = WiFi.status() == WL_CONNECTED;

    struct tm now = {};
    if (haveTime && getLocalTime(&now, 5)) {
        u.hasTime = true;
        u.hour = (uint8_t)now.tm_hour;
        u.minute = (uint8_t)now.tm_min;
    }
    return u;
}

static uint8_t rssiToBars(int32_t rssi) {
    // 구형 C6 펌웨어는 RSSI 질의(Req_WifiStaGetApInfo)에 답하지 않아 0 이 온다.
    // 붙어는 있으니 끊긴 것처럼 보이지 않게 중간으로 그린다.
    if (rssi == 0) return 2;
    if (rssi >= -55) return 4;
    if (rssi >= -65) return 3;
    if (rssi >= -75) return 2;
    if (rssi >= -85) return 1;
    return 0;
}

static void pollSlowStatus() {
    const bool up = WiFi.status() == WL_CONNECTED;
    const int16_t rssi = up ? (int16_t)WiFi.RSSI() : 0;
    const HwPower pw = hwReadPower();

    lockShared();
    shared.wifiRssi = rssi;
    shared.wifiBars = up ? rssiToBars(rssi) : 0;
    shared.power = pw;
    unlockShared();

    const uint32_t bufSize = audio.getInBufferSize();
    const uint32_t bufPct = bufSize ? (audio.inBufferFilled() * 100 / bufSize) : 0;
    const UiTiming ut = uiTakeTiming();
    // 버퍼는 퍼센트와 함께 크기도 적는다. PSRAM 이 크면 라이브러리가 버퍼를 크게
    // 잡아서, 같은 몇 초치가 S3 보드보다 작은 퍼센트로 보인다.
    RLOGI("배터리 %u%% (%.2fV%s%s%s)  VBUS %.2fV  Wi-Fi %ddBm  버퍼 %u%%/%uKB  힙 %u  가동 %lu분  "
          "화면 %u장 그리기 %u/%ums 전송 %u/%ums",
          (unsigned)pw.percent, pw.battMv / 1000.0f, pw.battery ? "" : ", 셀 없음",
          pw.charging ? ", 충전중" : "", pw.vbus ? ", USB" : "", pw.vbusMv / 1000.0f,
          (int)rssi, (unsigned)bufPct, (unsigned)(bufSize / 1024), (unsigned)ESP.getFreeHeap(),
          (unsigned long)(millis() / 60000), (unsigned)ut.frames, (unsigned)ut.drawAvg,
          (unsigned)ut.drawMax, (unsigned)ut.flushAvg, (unsigned)ut.flushMax);
}

// ── 터치 태스크 ───────────────────────────────────────────────────
// 화면 한 장을 SPI 로 밀어 넣는 동안 loop 는 멈춘다. 그 사이에 들어온 탭을
// 놓치지 않으려면 터치는 따로 돌아야 한다. 결과(UiEvent)는 큐로 loop 에 넘긴다.
static void touchTask(void*) {
    TouchPoint pts[2];
    for (;;) {
        const uint8_t n = touchRead(pts, 2);
        const UiState s = snapshotUi();
        const UiEvent ev = uiHandleTouch(pts, n, s);
        if (ev.action != UiAction::NONE) xQueueSend(uiEventQueue, &ev, 0);
        vTaskDelay(pdMS_TO_TICKS(kTouchPeriodMs));
    }
}

// ── 전원 끄기 ─────────────────────────────────────────────────────
static void powerOff(const char* why) {
    RLOGI("전원 끔 (%s)", why);
    if (audioTaskHandle) vTaskSuspend(audioTaskHandle);
    audio.stopSong();
    codec.setMute(true);
    hwSpeakerAmp(false);
    WiFi.disconnect(true);
    savePrefs();
    uiScreenOff();
    Serial.flush();
    delay(50);
    hwPowerOff();   // 돌아오지 않는다
}

// ── Wi-Fi 접속 ────────────────────────────────────────────────────
static volatile uint8_t lastWifiReason = 0;

static void onWifiEvent(arduino_event_id_t id, arduino_event_info_t info) {
    if (id == ARDUINO_EVENT_WIFI_STA_DISCONNECTED) {
        lastWifiReason = info.wifi_sta_disconnected.reason;
        RLOGI("Wi-Fi 끊김 (reason=%u)", (unsigned)lastWifiReason);
    }
}

static String wifiReasonText() {
    const uint8_t r = lastWifiReason;
    if (!r) return String();
    const char* what = "";
    switch (r) {
        case 2:   what = " auth expire"; break;
        case 15:  what = " handshake"; break;
        case 201: what = " no AP"; break;
        case 202: what = " auth fail"; break;
        case 205: what = " conn fail"; break;
        default:  break;
    }
    return "fail r" + String((unsigned)r) + what;
}

static bool wifiRecovery = false;

// 슬레이브가 버전을 말해 주지 않으면(구형 펌웨어) true.
static bool logHostedVersions() {
#if CONFIG_ESP_HOSTED_ENABLED
    uint32_t hM, hm, hp, sM, sm, sp;
    hostedGetHostVersion(&hM, &hm, &hp);
    hostedGetSlaveVersion(&sM, &sm, &sp);
    RLOGI("ESP-Hosted 호스트 %lu.%lu.%lu / C6 슬레이브 %lu.%lu.%lu%s",
          (unsigned long)hM, (unsigned long)hm, (unsigned long)hp,
          (unsigned long)sM, (unsigned long)sm, (unsigned long)sp,
          (hM == sM && hm == sm) ? "" : "  <- 버전 불일치");
    return (sM == 0 && sm == 0 && sp == 0);
#else
    return false;
#endif
}

// 공장 출하 C6 펌웨어는 리셋 뒤 한동안 Wi-Fi 명령을 받지 않는다. 초기화 직후에
// WiFi.begin() 을 부르면 25초를 기다려도 status 0 에서 멈췄고, 10초쯤 뒤에
// 부르면 바로 붙었다(C6 갱신을 시도하느라 우연히 늦어진 부팅에서 발견).
// 버전을 말해 주는 새 펌웨어에서는 필요 없어 보여서 구형일 때만 기다린다.
constexpr uint32_t kOldSlaveSettleMs = 10000;

static bool connectWifi(uint8_t attempts) {
    const WifiCreds c = wifiLoadCreds();

