ducklove/esp32-epaper-fm-radio/src/boards/p4/main.cpp
    xTaskCreatePinnedToCore(audioTask, "audio", 16384, nullptr, 3, &audioTaskHandle, 1);

    lockShared();
    const uint8_t startIndex = shared.index;
    unlockShared();
    const Cmd cmd{Cmd::TUNE, startIndex};
    xQueueSend(cmdQueue, &cmd, 0);
}

// 터치 이벤트를 실제 동작으로.
static void handleUiEvent(const UiEvent& ev) {
    switch (ev.action) {
        case UiAction::NONE:
            return;
        case UiAction::TUNE:
        case UiAction::PREV:
        case UiAction::NEXT: {
            lockShared();
            if (ev.action == UiAction::TUNE)      shared.index = ev.value;
            else if (ev.action == UiAction::NEXT) shared.index = (uint8_t)((shared.index + 1) % kStationCount);
            else                                  shared.index = (uint8_t)((shared.index + kStationCount - 1) % kStationCount);
            shared.bitrate = 0;
            const uint8_t idx = shared.index;
            const bool paused = shared.paused;
            unlockShared();
            savePrefs();
            if (paused) {
                const Cmd c{Cmd::RESUME, 0};   // 멈춘 채로 채널을 고르면 그 채널로 재개
                xQueueSend(cmdQueue, &c, 0);
            } else {
                const Cmd c{Cmd::TUNE, idx};
                xQueueSend(cmdQueue, &c, 0);
            }
            break;
        }
        case UiAction::TOGGLE_PAUSE: {
            lockShared();
            const bool paused = shared.paused;
            unlockShared();
            const Cmd c{paused ? Cmd::RESUME : Cmd::PAUSE, 0};
            xQueueSend(cmdQueue, &c, 0);
            break;
        }
        case UiAction::VOLUME: {
            lockShared();
            shared.volume = (ev.value > kVolumeSteps) ? kVolumeSteps : ev.value;
            unlockShared();
            applyVolume();
            break;
        }
        case UiAction::WIFI_SETUP:
            if (audioTaskHandle) vTaskSuspend(audioTaskHandle);
            audio.stopSong();
            runWifiPortal();
            if (audioTaskHandle) vTaskResume(audioTaskHandle);
            break;
        case UiAction::SCREEN_OFF:
            uiScreenOff();
            break;
        case UiAction::POWER_OFF:
            powerOff("버튼");   // 돌아오지 않는다
            break;
    }
}

void loop() {
    static uint32_t lastRetry = 0;
    static uint32_t wifiDownSince = 0;   // 끊김을 처음 본 시각. 붙어 있으면 0
    if (wifiRecovery) {
        if (millis() - lastRetry > kWifiRecoveryMs) {
            lastRetry = millis();
            if (connectWifi(1)) {
                RLOGI("Wi-Fi 복구됨 — 재시작");
                delay(200);
                ESP.restart();
            }
        }
    } else if (WiFi.status() != WL_CONNECTED) {
        // 붙었다가 끊긴 경우. 처음에는 여기서 10초마다 WiFi.reconnect() 를 불렀는데,
        // 구형 C6 펌웨어는 그 안의 Req_WifiDisconnect RPC 에 답하지 않아 호출이
        // 10초씩 통째로 막혔다. 다시 붙지도 않으면서 loop 만 세워 두니 화면이
        // 10초에 한 번 갱신되고 터치도 그때만 처리됐다 — 14시간 뒤 "잠에서 안
        // 깨어난다"로 보였던 것이 이것이다.
        //
        // 이 슬레이브에서 믿을 수 있는 복구는 부팅 경로(C6 리셋 + 10초 대기)뿐이다.
        // 끊긴 채 kWifiLostRestartMs 가 지나면 재시작한다. 설정은 NVS 에 있다.
        if (!wifiDownSince) {
            wifiDownSince = millis();
            RLOGE("Wi-Fi 끊김 감지 — %lu초 안에 안 돌아오면 재시작",
                  (unsigned long)(kWifiLostRestartMs / 1000));
            if (audioTaskHandle) {
                lockShared();
                const bool paused = shared.paused;
                unlockShared();
                if (!paused) setState(ST_ERROR, "WIFI LOST");
            }
            uiWake();
        } else if (millis() - wifiDownSince > kWifiLostRestartMs) {
            RLOGE("Wi-Fi 가 돌아오지 않는다 — 재시작");
            setState(ST_ERROR, "WIFI LOST - RESTART");
            uiRender(snapshotUi());
            savePrefs();
            Serial.flush();
            delay(300);
            ESP.restart();
        }
    } else {
        wifiDownSince = 0;
    }

    // ── 터치 이벤트 (터치 태스크가 보낸 것) ──────────────────────
    UiEvent ev;
    while (xQueueReceive(uiEventQueue, &ev, 0) == pdTRUE) handleUiEvent(ev);

    // 끌고 있으면 바늘·슬라이더가 손을 따라가야 한다. 다만 폴링마다가 아니라
    // 20fps 로 — 한 장 전송이 끝나기 전에 다음 장을 그릴 이유가 없다.
    if (uiNeedsRedraw() && uiScreenIsOn() && millis() - lastUiMs >= kDragFrameMs) {
        uiRender(snapshotUi());
        lastUiMs = millis();
    }
    uiTickBacklight();

    if (WiFi.status() == WL_CONNECTED) ArduinoOTA.handle();

    static uint32_t lastStatusMs = 0;
    if (millis() - lastStatusMs > kStatusPeriodMs) {
        lastStatusMs = millis();
        pollSlowStatus();

        // 배터리 컷오프. 외부 전원이 들어오면 지킬 일이 없다.
        static uint8_t strikes = 0;
        lockShared();
        const HwPower pw = shared.power;
        unlockShared();
        if (pw.battery && !pw.vbus && !pw.charging && pw.battMv >= 2500 &&
            pw.percent <= BATT_CUTOFF_PERCENT) {
            if (++strikes >= BATT_CUTOFF_STRIKES) {
                RLOGE("배터리 %u%% — 자동 종료", (unsigned)pw.percent);
                setState(ST_LOWBATT);
                uiWake();
                uiRender(snapshotUi());
                delay(3000);
                powerOff("배터리");
            }
        } else {
            strikes = 0;
        }
    }

    if (uiScreenIsOn() && millis() - lastUiMs > kUiPeriodMs) {
        lastUiMs = millis();
        uiRender(snapshotUi());
    }

    delay(5);
}
